In [1]:
import pandas as pd
import sqlite3

In [2]:
# creating database connection
conn = sqlite3.connect('wash.db')

In [3]:
# checking tables present in the database
tables = pd.read_sql_query("SELECT name FROM sqlite_master WHERE type='table';", conn)
tables

                                               name
0  sdg_drinking_water_service_levels_by_region_year
1             hygiene_service_levels_by_region_year
2          sanitation_service_levels_by_region_year

Connecting to the wash.db SQLite database, retrieving the list of all tables present in the database, and then for each table:

- Printing the table name and a separator line.
- Printing the total number of records in the table.
- Displaying the first 5 rows of data from the table.

This helps us quickly explore and understand the structure and contents of each table in your database.

In [4]:
for table in tables['name']:
    print('-'*50, f'{table}','-'*50)
    print('Count of records:', pd.read_sql(f"SELECT count(*) as count from {table}", conn)['count'].values[0])
    display(pd.read_sql(f"SELECT * from {table} LIMIT 5", conn))

-------------------------------------------------- sdg_drinking_water_service_levels_by_region_year --------------------------------------------------
Count of records: 2634

,Type,Region,Residence Type,Service Type,Year,Coverage,Population,Service level
0,sdg,Australia and New Zealand,total,Drinking water,2000,99.76079,2.281851e+07,At least basic
1,sdg,Australia and New Zealand,rural,Drinking water,2000,99.20040,3.508827e+06,At least basic
2,sdg,Australia and New Zealand,total,Drinking water,2001,99.75979,2.308214e+07,At least basic
3,sdg,Australia and New Zealand,rural,Drinking water,2001,99.19829,3.572236e+06,At least basic
4,sdg,Australia and New Zealand,total,Drinking water,2002,99.76071,2.336838e+07,At least basic

-------------------------------------------------- hygiene_service_levels_by_region_year --------------------------------------------------
Count of records: 85

,Unnamed: 0,Region,Year,Basic Hygiene,Limited Hygiene,No handwashing facility
0,0,Central and Southern Asia,2010,178.89795,107.61639,13.48567
1,1,Central and Southern Asia,2011,180.64756,106.15612,13.19632
2,2,Central and Southern Asia,2012,182.54004,104.81504,12.64492
3,3,Central and Southern Asia,2013,184.46369,103.26237,12.27392
4,4,Central and Southern Asia,2014,186.36567,101.92441,11.70989

-------------------------------------------------- sanitation_service_levels_by_region_year --------------------------------------------------
Count of records: 184

,Unnamed: 0,Region,Year,Basic Sanitation,Limited Sanitation,Open Defecation,Safely Managed Sanitation,Unimproved Sanitation
0,0,Australia and New Zealand,2000,6.42874,0.0,0.0,93.56357,0.00769
1,1,Australia and New Zealand,2001,6.32666,0.0,0.0,93.66607,0.00728
2,2,Australia and New Zealand,2002,6.22457,0.0,0.0,93.76857,0.00686
3,3,Australia and New Zealand,2003,6.12248,0.0,0.0,93.87108,0.00644
4,4,Australia and New Zealand,2004,6.02040,0.0,0.0,93.97358,0.00602